-- MySQL dump 10.13  Distrib 5.7.26-29, for Linux (x86_64)
--
-- Host: localhost    Database: a0429275_timetable
-- ------------------------------------------------------
-- Server version	5.7.26-29

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
/*!50717 SELECT COUNT(*) INTO @rocksdb_has_p_s_session_variables FROM INFORMATION_SCHEMA.TABLES WHERE TABLE_SCHEMA = 'performance_schema' AND TABLE_NAME = 'session_variables' */;
/*!50717 SET @rocksdb_get_is_supported = IF (@rocksdb_has_p_s_session_variables, 'SELECT COUNT(*) INTO @rocksdb_is_supported FROM performance_schema.session_variables WHERE VARIABLE_NAME=\'rocksdb_bulk_load\'', 'SELECT 0') */;
/*!50717 PREPARE s FROM @rocksdb_get_is_supported */;
/*!50717 EXECUTE s */;
/*!50717 DEALLOCATE PREPARE s */;
/*!50717 SET @rocksdb_enable_bulk_load = IF (@rocksdb_is_supported, 'SET SESSION rocksdb_bulk_load = 1', 'SET @rocksdb_dummy_bulk_load = 0') */;
/*!50717 PREPARE s FROM @rocksdb_enable_bulk_load */;
/*!50717 EXECUTE s */;
/*!50717 DEALLOCATE PREPARE s */;

--
-- Table structure for table `lessons1`
--

DROP TABLE IF EXISTS `lessons1`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `lessons1` (
  `day_of_week` varchar(1) DEFAULT NULL,
  `lesson_number` varchar(2) DEFAULT NULL,
  `lesson_time` varchar(11) DEFAULT NULL,
  `lesson_name` varchar(14) DEFAULT NULL,
  `zoom_id` varchar(10) DEFAULT NULL,
  `zoom_pass` varchar(6) DEFAULT NULL,
  `teacher` varchar(30) DEFAULT NULL,
  `flag_lesson` varchar(1) DEFAULT NULL,
  `NULL` varchar(10) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `lessons1`
--

LOCK TABLES `lessons1` WRITE;
/*!40000 ALTER TABLE `lessons1` DISABLE KEYS */;
INSERT INTO `lessons1` VALUES ('1','1','9:00-9:40','Информатика','','','Баранова Мария Сергеевна','0',NULL),('1','2','9:50-10:30','Информатика','6043889124','1580','Баранова Мария Сергеевна','1',NULL),('1','3','10:45-11:25','Лекция(м)','','','Ворошилова Татьяна Николаевна','0',NULL),('1','4','11:40-12:20','Лекция(м)','','','Ворошилова Татьяна Николаевна','0',NULL),('1','5','12:40-13:20','Мат. анализ','7718936849','1580','Ворошилова Татьяна Николаевна','1',NULL),('1','6','13:40-14:20','Мат. анализ','','','Ворошилова Татьяна Николаевна','0',NULL),('1','7','14:35-15:15','Обществознание','4984807967','1580','Богатин Андрей Аркадьевич','1',NULL),('1','8','15:25-16:05','Химия','4693647502','1580','Трофимова Елена Викторовна','1',NULL),('1','9','','','','','','0',NULL),('1','10','','','','','','0',NULL),('2','1','9:00-9:40','Геометрия','','','Ворошилова Татьяна Николаевна','0',NULL),('2','2','9:50-10:30','Геометрия','','','Ворошилова Татьяна Николаевна','0',NULL),('2','3','10:45-11:25','Геометрия','7718936849','1580','Ворошилова Татьяна Николаевна','1',NULL),('2','4','11:40-12:20','Фп','6607626078','158011','Белолипецкий Сергей Николаевич','1',NULL),('2','5','12:40-13:20','Фп','','','Белолипецкий Сергей Николаевич','0',NULL),('2','6','13:40-14:20','Астрономия','','','Медяник Юлия Юрьевна','0',NULL),('2','7','14:35-15:15','Литература','5806769001','1580','Петрова Алла Петровна','1',NULL),('2','8','15:25-16:05','Литература','','','Петрова Алла Петровна','0',NULL),('2','9','','','','','','0',NULL),('2','10','','','','','','0',NULL),('3','1','9:00-9:40','История','','','Ларина Марина Валентиновна','0',NULL),('3','2','9:50-10:30','Физика','6607626078','158011','Белолипецкий Сергей Николаевич','1',NULL),('3','3','10:45-11:25','Физика','6607626078','158011','Белолипецкий Сергей Николаевич','1',NULL),('3','4','11:40-12:20','Физика','6607626078','158011','Белолипецкий Сергей Николаевич','1',NULL),('3','5','12:40-13:20','Информатика','6043889124','1580','Баранова Мария Сергеевна','0',NULL),('3','6','13:40-14:20','Информатика','6043889124','1580','Баранова Мария Сергеевна','1',NULL),('3','7','14:35-15:15','Английский','','','Сергеева Валентина Петровна','0',NULL),('3','8','15:25-16:05','Английский','','','Сергеева Валентина Петровна','0',NULL),('3','9','','','','','','0',NULL),('3','10','','','','','','0',NULL),('4','1','9:00-9:40','Русский язык','5806769001','1580','Петрова Алла Петровна','1',NULL),('4','2','9:50-10:30','Русский язык','','','Петрова Алла Петровна','0',NULL),('4','3','10:45-11:25','Физ-ра','','','Романова Надежда Александровна','0',NULL),('4','4','11:40-12:20','Физ-ра','','','Романова Надежда Александровна','0',NULL),('4','5','12:40-13:20','История','6974909599','1580','Ларина Марина Валентиновна','1',NULL),('4','6','13:40-14:20','Английский','5524667933','1580','Сергеева Валентина Петровна','1',NULL),('4','7','14:35-15:15','Химия','','','Трофимова Елена Викторовна','0',NULL),('4','8','15:25-16:05','Литература','','','Петрова Алла Петровна','0',NULL),('4','9','','','','','','0',NULL),('4','10','','','','','','0',NULL),('5','1','9:00-9:40','Лекция(ф)','','','Белолипецкий Сергей Николаевич','0',NULL),('5','2','9:50-10:30','Лекция(ф)','','','Белолипецкий Сергей Николаевич','0',NULL),('5','3','10:45-11:25','Алгебра','7718936849','1580','Ворошилова Татьяна Николаевна','1',NULL),('5','4','11:40-12:20','Алгебра','','','Ворошилова Татьяна Николаевна','0',NULL),('5','5','12:40-13:20','Физика','6607626078','158011','Белолипецкий Сергей Николаевич','1',NULL),('5','6','13:40-14:20','Физика','6607626078','158011','Белолипецкий Сергей Николаевич','1',NULL),('5','7','14:35-15:15','','','','','0',NULL),('5','8','15:25-16:05','','','','','0',NULL),('5','9','','','','','','0',NULL),('5','10','','','','','','0',NULL),('6','1','','','','','','0',NULL),('6','2','','','','','','0',NULL),('6','3','','','','','','0',NULL),('6','4','','','','','','0',NULL),('6','5','','','','','','0',NULL),('6','6','','','','','','0',NULL),('6','7','','','','','','0',NULL),('6','8','','','','','','0',NULL),('6','9','','','','','','0',NULL),('6','10','','','','','','0',NULL),('0','1','','','','','','0',NULL),('0','2','','','','','','0',NULL),('0','3','','','','','','0',NULL),('0','4','','','','','','0',NULL),('0','5','','','','','','0',NULL),('0','6','','','','','','0',NULL),('0','7','','','','','','0',NULL),('0','8','','','','','','0',NULL),('0','9','','','','','','0',NULL),('0','10','','','','','','0',NULL),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','','');
/*!40000 ALTER TABLE `lessons1` ENABLE KEYS */;
UNLOCK TABLES;
/*!50112 SET @disable_bulk_load = IF (@is_rocksdb_supported, 'SET SESSION rocksdb_bulk_load = @old_rocksdb_bulk_load', 'SET @dummy_rocksdb_bulk_load = 0') */;
/*!50112 PREPARE s FROM @disable_bulk_load */;
/*!50112 EXECUTE s */;
/*!50112 DEALLOCATE PREPARE s */;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2020-05-25  1:14:04
-- MySQL dump 10.13  Distrib 5.7.26-29, for Linux (x86_64)
--
-- Host: localhost    Database: a0429275_timetable
-- ------------------------------------------------------
-- Server version	5.7.26-29

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
/*!50717 SELECT COUNT(*) INTO @rocksdb_has_p_s_session_variables FROM INFORMATION_SCHEMA.TABLES WHERE TABLE_SCHEMA = 'performance_schema' AND TABLE_NAME = 'session_variables' */;
/*!50717 SET @rocksdb_get_is_supported = IF (@rocksdb_has_p_s_session_variables, 'SELECT COUNT(*) INTO @rocksdb_is_supported FROM performance_schema.session_variables WHERE VARIABLE_NAME=\'rocksdb_bulk_load\'', 'SELECT 0') */;
/*!50717 PREPARE s FROM @rocksdb_get_is_supported */;
/*!50717 EXECUTE s */;
/*!50717 DEALLOCATE PREPARE s */;
/*!50717 SET @rocksdb_enable_bulk_load = IF (@rocksdb_is_supported, 'SET SESSION rocksdb_bulk_load = 1', 'SET @rocksdb_dummy_bulk_load = 0') */;
/*!50717 PREPARE s FROM @rocksdb_enable_bulk_load */;
/*!50717 EXECUTE s */;
/*!50717 DEALLOCATE PREPARE s */;

--
-- Table structure for table `lessons2`
--

DROP TABLE IF EXISTS `lessons2`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `lessons2` (
  `day_of_week` varchar(1) DEFAULT NULL,
  `lesson_number` varchar(2) DEFAULT NULL,
  `lesson_time` varchar(11) DEFAULT NULL,
  `lesson_name` varchar(14) DEFAULT NULL,
  `zoom_id` varchar(10) DEFAULT NULL,
  `zoom_pass` varchar(6) DEFAULT NULL,
  `teacher` varchar(29) DEFAULT NULL,
  `flag_lesson` varchar(1) DEFAULT NULL,
  `NULL` varchar(10) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `lessons2`
--

LOCK TABLES `lessons2` WRITE;
/*!40000 ALTER TABLE `lessons2` DISABLE KEYS */;
INSERT INTO `lessons2` VALUES ('1','1','9:00-9:40','','','','','0',NULL),('1','2','9:50-10:30','Математика','7718936849','1580','Ворошилова Татьяна Николаевна','1',NULL),('1','3','10:45-11:25','','','','','0',NULL),('1','4','11:40-12:20','','','','','0',NULL),('1','5','12:40-13:20','Информатика','6043889124','1580','Баранова Мария Сергеевна','1',NULL),('1','6','13:40-14:20','','','','','0',NULL),('1','7','14:35-15:15','Обществознание','4984807967','1580','Богатин Андрей Аркадьевич','1',NULL),('1','8','15:25-16:05','Химия','4693647502','1580','Трофимова Елена Викторовна','1',NULL),('1','9','','','','','','0',NULL),('1','10','','','','','','0',NULL),('2','1','9:00-9:40','','','','','0',NULL),('2','2','9:50-10:30','','','','','0',NULL),('2','3','10:45-11:25','','','','','0',NULL),('2','4','11:40-12:20','','','','','0',NULL),('2','5','12:40-13:20','Математика','7718936849','1580','Ворошилова Татьяна Николаевна','1',NULL),('2','6','13:40-14:20','','','','','0',NULL),('2','7','14:35-15:15','Литература','5806769001','1580','Петрова Алла Петровна','1',NULL),('2','8','15:25-16:05','','','','','0',NULL),('2','9','','','','','','0',NULL),('2','10','','','','','','0',NULL),('3','1','9:00-9:40','','','','','0',NULL),('3','2','9:50-10:30','Русский язык','5806769001','1580','Петрова Алла Петровна','1',NULL),('3','3','10:45-11:25','','','','','0',NULL),('3','4','11:40-12:20','Физика','4138200567','секрет','Кулеба Наталия Сергеевна','1',NULL),('3','5','12:40-13:20','','','','','0',NULL),('3','6','13:40-14:20','','','','','0',NULL),('3','7','14:35-15:15','Информатика','6043889124','1580','Баранова Мария Сергеевна','1',NULL),('3','8','15:25-16:05','','','','','0',NULL),('3','9','','','','','','0',NULL),('3','10','','','','','','0',NULL),('4','1','9:00-9:40','Физика','4138200567','секрет','Кулеба Наталия Сергеевна','1',NULL),('4','2','9:50-10:30','','','','','0',NULL),('4','3','10:45-11:25','','','','','0',NULL),('4','4','11:40-12:20','','','','','0',NULL),('4','5','12:40-13:20','История','6974909599','1580','Ларина Марина Валентиновна','1',NULL),('4','6','13:40-14:20','Английский','7349250774','1580','Батурина Маргарита Ивановна','1',NULL),('4','7','14:35-15:15','','','','','0',NULL),('4','8','15:25-16:05','','','','','0',NULL),('4','9','','','','','','0',NULL),('4','10','','','','','','0',NULL),('5','1','9:00-9:40','','','','','0',NULL),('5','2','9:50-10:30','','','','','0',NULL),('5','3','10:45-11:25','ФП','2935998351','1580','Балашова Ольга Васильевна','1',NULL),('5','4','11:40-12:20','','','','','0',NULL),('5','5','12:40-13:20','Математика','7718936849','1580','Ворошилова Татьяна Николаевна','1',NULL),('5','6','13:40-14:20','','','','','0',NULL),('5','7','14:35-15:15','','','','','0',NULL),('5','8','15:25-16:05','','','','','0',NULL),('5','9','','','','','','0',NULL),('5','10','','','','','','0',NULL),('6','1','','','','','','0',NULL),('6','2','','','','','','0',NULL),('6','3','','','','','','0',NULL),('6','4','','','','','','0',NULL),('6','5','','','','','','0',NULL),('6','6','','','','','','0',NULL),('6','7','','','','','','0',NULL),('6','8','','','','','','0',NULL),('6','9','','','','','','0',NULL),('6','10','','','','','','0',NULL),('0','1','','','','','','0',NULL),('0','2','','','','','','0',NULL),('0','3','','','','','','0',NULL),('0','4','','','','','','0',NULL),('0','5','','','','','','0',NULL),('0','6','','','','','','0',NULL),('0','7','','','','','','0',NULL),('0','8','','','','','','0',NULL),('0','9','','','','','','0',NULL),('0','10','','','','','','0',NULL),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','',''),('','','','','','','','','');
/*!40000 ALTER TABLE `lessons2` ENABLE KEYS */;
UNLOCK TABLES;
/*!50112 SET @disable_bulk_load = IF (@is_rocksdb_supported, 'SET SESSION rocksdb_bulk_load = @old_rocksdb_bulk_load', 'SET @dummy_rocksdb_bulk_load = 0') */;
/*!50112 PREPARE s FROM @disable_bulk_load */;
/*!50112 EXECUTE s */;
/*!50112 DEALLOCATE PREPARE s */;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2020-05-25  1:14:04
